#### 4.6 Course Exercise

## Importing

In [5]:
#importing libraries
import pandas as pd
import numpy as np
import os

In [6]:
#importing dataframes
path = r'C:\Users\slave\OneDrive\Documents\Instacart Basket Analysis\Data'

In [ ]:
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'order_products__prior.csv'), index_col = False)

In [ ]:
#Importing df_ords_prepared Data

df_ords_prepared = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [7]:
#Checking Output
df_ord_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [8]:
#view df_ords
df_ords.head()

,Unnamed: 0,Unnamed: 0.1,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,customer_status
0,0,0,2539329,1,1,2,8,NaN,New Customer
1,1,1,2398795,1,2,3,7,15.0,Returning Customer
2,2,2,473747,1,3,3,12,21.0,Returning Customer
3,3,3,2254736,1,4,4,7,29.0,Returning Customer
4,4,4,431534,1,5,4,15,28.0,Returning Customer

In [9]:
#checking df shape to determine which cobination method to use
df_ord_prior.shape

(32434489, 4)

In [16]:
df_ord_prior.isnull().sum()

order_id             0
product_id           0
add_to_cart_order    0
reordered            0
dtype: int64

In [17]:
df_po_dups=df_ord_prior[df_ord_prior.duplicated()]
df_po_dups

Empty DataFrame
Columns: [order_id, product_id, add_to_cart_order, reordered]
Index: []

In [10]:
#checking df shape to determine which cobination method to use
df_ords.shape

(3421083, 9)

## Merging Dataframes

In [11]:
#Merge df_ords_prior with df_ords using default inner join
df_merged_large = df_ords.merge(df_ord_prior, on = 'order_id', indicator = True)

In [12]:
df_merged_large.head()

,Unnamed: 0,Unnamed: 0.1,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,customer_status,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,1,2,8,NaN,New Customer,196,1,0,both
1,0,0,2539329,1,1,2,8,NaN,New Customer,14084,2,0,both
2,0,0,2539329,1,1,2,8,NaN,New Customer,12427,3,0,both
3,0,0,2539329,1,1,2,8,NaN,New Customer,26088,4,0,both
4,0,0,2539329,1,1,2,8,NaN,New Customer,26405,5,0,both

In [13]:
#Checking if Full Match
df_merged_large['_merge'].value_counts()

both          32434489
right_only           0
left_only            0
Name: _merge, dtype: int64

In [14]:
#Checking Shape
df_merged_large.shape

(32434489, 13)

## Exporting

In [15]:
# Export data to csv
df_merged_large.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.csv'))

# Export data to pkl
df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))